# ViewportAttrShowExtensionLine Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewportAttrShowExtensionLine Property
ParameterTypeId Class See Also
---
"Show Extension Line"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewportAttrShowExtensionLine { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewportAttrShowExtensionLine As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewportAttrShowExtensionLine {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace